[
  {
    "name": "Cappuccino",
    "liked": true,
    "ingredients": [
      {
        "name": "coffee beans",
        "amount": "7 g"
      },
      {
        "name": "water",
        "amount": "60 ml"
      },
      {
        "name": "milk",
        "amount": "100 ml"
      }
    ],
    "recipe": [
      "Make the espresso: Use an espresso machine, espresso maker, or Aeropress to brew a shot of espresso according to the instructions for your equipment.",
      "Steam the milk (espresso machine method): Fill a stainless steel pitcher halfway with cold milk. Position the steam wand just below the milk's surface and gradually open the steam valve. Move the steam wand deeper as the milk expands, heating and frothing it. Steam the milk until it reaches a temperature of around 150 degrees Fahrenheit.",
      "Froth the milk (stovetop method): Pour the desired amount of milk into a small saucepan and heat it over medium-low heat. Stir occasionally and remove from heat when the milk reaches approximately 150 degrees Fahrenheit. Froth the milk using a handheld frother, whisk, or by transferring it to a blender and blending until frothy.",
      "Serve the cappuccino: Pour the brewed espresso into a latte cup or a suitable cup. Gently pour the frothed milk over the espresso, aiming for equal proportions of espresso, steamed milk, and foam (about 1/3 each). Serve the cappuccino immediately for optimal flavor and texture. Optionally, sprinkle cocoa powder, cinnamon, or nutmeg on top of the foam as a garnish."
    ],
    "colors": [
      {
        "offset": "0%",
        "stopColor": "transparent"
      },
      {
        "offset": "20%",
        "stopColor": "transparent"
      },
      {
        "offset": "20%",
        "stopColor": "#fdf5e6"
      },
      {
        "offset": "48%",
        "stopColor": "#fdf5e6"
      },
      {
        "offset": "48%",
        "stopColor": "#faebd7"
      },
      {
        "offset": "76%",
        "stopColor": "#faebd7"
      },
      {
        "offset": "76%",
        "stopColor": "#86563a"
      },
      {
        "offset": "100%",
        "stopColor": "#86563a"
      }
    ]
  },
  {
    "name": "Latte",
    "liked": false,
    "ingredients": [
      {
        "name": "coffee beans",
        "amount": "7 g"
      },
      {
        "name": "water",
        "amount": "60 ml"
      },
      {
        "name": "milk",
        "amount": "150 ml"
      }
    ],
    "recipe": [
      "Make the espresso: Use an espresso machine, espresso maker, or Aeropress to brew a shot of espresso according to the instructions for your equipment.",
      "Steam the milk (espresso machine method): Fill a stainless steel pitcher halfway with cold milk. Position the steam wand just below the milk's surface and gradually open the steam valve. Move the steam wand deeper as the milk expands, heating and frothing it. Steam the milk until it reaches a temperature of around 150 degrees Fahrenheit.",
      "Froth the milk (stovetop method): Pour the desired amount of milk into a small saucepan and heat it over medium-low heat. Stir occasionally and remove from heat when the milk reaches approximately 150 degrees Fahrenheit. Froth the milk using a handheld frother, whisk, or by transferring it to a blender and blending until frothy.",
      "Wait for the foam to incorporate: After frothing the milk, let it sit for 30 seconds to 1 minute. This allows the foam to incorporate into the milk, creating a creamy texture.",
      "Combine the espresso and milk: Pour the steamed or frothed milk into the espresso, aiming for equal parts espresso and milk. For a traditional cappuccino, aim for a ratio of 1/3 espresso, 1/3 steamed milk, and 1/3 foam.",
      "Enjoy: Serve your cappuccino immediately and savor the rich flavors of the espresso and velvety texture of the steamed or frothed milk."
    ],
    "colors": [
      {
        "offset": "0%",
        "stopColor": "transparent"
      },
      {
        "offset": "15%",
        "stopColor": "transparent"
      },
      {
        "offset": "15%",
        "stopColor": "#fdf5e6"
      },
      {
        "offset": "31%",
        "stopColor": "#fdf5e6"
      },
      {
        "offset": "31%",
        "stopColor": "#faebd7"
      },
      {
        "offset": "76%",
        "stopColor": "#faebd7"
      },
      {
        "offset": "76%",
        "stopColor": "#86563a"
      },
      {
        "offset": "100%",
        "stopColor": "#86563a"
      }
    ]
  },
  {
    "name": "Americano",
    "liked": false,
    "ingredients": [
      {
        "name": "coffee beans",
        "amount": "14 g"
      },
      {
        "name": "water",
        "amount": "160 ml"
      }
    ],
    "recipe": [
      "Decide on your drink size: Determine the size of your drink based on your preference. A 1-shot Americano is typically suitable for an espresso mug, while a 2-shot Americano is best suited for a latte mug.",
      "Make the espresso: Use an espresso machine, espresso maker, or Aeropress to brew a shot of espresso according to the instructions for your equipment.",
      "Boil the water: Use a regular kettle or an electric teapot to bring water to a boil. The standard ratio for a Caffè Americano is 2 parts water to 1 part espresso, but you can adjust the ratio to your preference, going up to 3 parts water to 1 part espresso.",
      "Mix the two and enjoy: Pour the boiling water into the espresso shot(s) in your mug. The hot water will dilute the espresso, creating a milder flavor and a larger volume. Stir gently to combine the water and espresso.",
      "Serve and savor: Your Caffè Americano is ready to be enjoyed. Take a moment to appreciate the rich aroma and smooth taste of the coffee. You can add sugar, milk, or other desired flavorings to customize your drink further."
    ],
    "colors": [
      {
        "offset": "0%",
        "stopColor": "transparent"
      },
      {
        "offset": "49%",
        "stopColor": "transparent"
      },
      {
        "offset": "49%",
        "stopColor": "#86563a"
      },
      {
        "offset": "100%",
        "stopColor": "#86563a"
      }
    ]
  },
  {
    "name": "Flat White",
    "liked": true,
    "ingredients": [
      {
        "name": "coffee beans",
        "amount": "7 g"
      },
      {
        "name": "water",
        "amount": "60 ml"
      },
      {
        "name": "milk",
        "amount": "100 ml"
      }
    ],
    "recipe": [
      "Make the espresso: Use an espresso machine, espresso maker, or Aeropress to brew a shot of espresso according to the instructions for your equipment.",
      "Steam the milk (espresso machine method): Fill a stainless steel pitcher halfway with cold milk. Position the steam wand just below the milk's surface and gradually open the steam valve. Move the steam wand deeper as the milk expands, heating and frothing it. Steam the milk until it reaches a temperature of around 150 degrees Fahrenheit.",
      "Froth the milk (stovetop method): Pour the desired amount of milk into a small saucepan and heat it over medium-low heat. Stir occasionally and remove from heat when the milk reaches approximately 150 degrees Fahrenheit. Froth the milk using a handheld frother, whisk, or by transferring it to a blender and blending until frothy.",
      "Incorporate the foam: After frothing the milk, wait for 30 seconds to 1 minute to allow the foam to incorporate slightly into the milk. This will help create a creamy texture in your drink.",
      "Assemble and enjoy: Pour the prepared espresso into a cup, then slowly pour the steamed milk over it. Aim for a balance of espresso and steamed milk, adjusting the ratio to your preference. The foam should sit on top of the milk. Experiment with different ratios and pour techniques to achieve your desired presentation.",
      "Customize and refine: Feel free to experiment with different techniques, milk types, and flavor additions to find the perfect combination that suits your taste. Everyone's preferences and equipment may vary, so don't be afraid to explore and refine your method until you achieve your ideal espresso and milk drink."
    ],
    "colors": [
      {
        "offset": "0%",
        "stopColor": "transparent"
      },
      {
        "offset": "31%",
        "stopColor": "transparent"
      },
      {
        "offset": "31%",
        "stopColor": "#faebd7"
      },
      {
        "offset": "76%",
        "stopColor": "#faebd7"
      },
      {
        "offset": "76%",
        "stopColor": "#86563a"
      },
      {
        "offset": "100%",
        "stopColor": "#86563a"
      }
    ]
  },
  {
    "name": "Mocha",
    "liked": true,
    "ingredients": [
      {
        "name": "coffee beans",
        "amount": "14 g"
      },
      {
        "name": "water",
        "amount": "100 ml"
      },
      {
        "name": "milk",
        "amount": "100 ml"
      },
      {
        "name": "maple syrup",
        "amount": "30 ml"
      },
      {
        "name": "chocolate chips",
        "amount": "25 g"
      }
    ],
    "recipe": [
      "Prepare the cup: Place chocolate chips in a cup or mug. The amount of chocolate chips can vary based on your desired level of chocolate flavor.",
      "Add espresso: Pour freshly brewed espresso over the chocolate chips in the cup. The heat from the espresso will melt the chocolate, creating a rich and indulgent base for your mocha.",
      "Steam the milk and syrup (espresso machine method): If you have an espresso machine with a steam wand, steam the milk and add a little maple syrup or simple syrup for sweetness. Fill a stainless steel pitcher with cold milk, add a small amount of syrup, and place the steam wand just below the surface of the milk. Steam the milk until it reaches a temperature of around 150 degrees Fahrenheit. The milk should be hot to the touch but not simmering.",
      "Heat and froth the milk and syrup (non-machine method): If you don't have an espresso machine, you can heat the milk and syrup on the stovetop. Pour the milk and syrup into a pan and heat it over medium-low heat. Use a thermometer to monitor the temperature and remove the milk from the heat when it reaches 150 degrees Fahrenheit. Froth the milk using your desired method until it becomes very foamy.",
      "Pour and serve: Pour the frothed milk over the chocolaty espresso in the cup. Aim for a balance between the espresso and the frothed milk. The foam from the milk should sit on top of the mocha. Stir gently to incorporate the melted chocolate with the milk and espresso.",
      "Enjoy your homemade mocha: Sit back, relax, and savor the rich, chocolaty goodness of your homemade mocha. It's a delightful treat that is sure to satisfy your cravings for a decadent coffee drink."
    ],
    "colors": [
      {
        "offset": "0%",
        "stopColor": "transparent"
      },
      {
        "offset": "15%",
        "stopColor": "transparent"
      },
      {
        "offset": "15%",
        "stopColor": "#fffaf0"
      },
      {
        "offset": "35%",
        "stopColor": "#fffaf0"
      },
      {
        "offset": "35%",
        "stopColor": "#faebd7"
      },
      {
        "offset": "55%",
        "stopColor": "#faebd7"
      },
      {
        "offset": "55%",
        "stopColor": "#d2691e"
      },
      {
        "offset": "72%",
        "stopColor": "#d2691e"
      },
      {
        "offset": "72%",
        "stopColor": "#86563a"
      },
      {
        "offset": "96%",
        "stopColor": "#86563a"
      },
      {
        "offset": "96%",
        "stopColor": "#593927"
      },
      {
        "offset": "100%",
        "stopColor": "#593927"
      }
    ]
  },
  {
    "name": "Macchiato",
    "liked": false,
    "ingredients": [
      {
        "name": "coffee beans",
        "amount": "14 g"
      },
      {
        "name": "water",
        "amount": "120 ml"
      },
      {
        "name": "milk",
        "amount": "60 ml"
      }
    ],
    "recipe": [
      "Make the espresso: Use an espresso machine, espresso maker, or Aeropress to brew a shot of espresso according to the instructions for your equipment.",
      "Heat the milk: Pour the desired amount of milk into a saucepan and heat it on the stovetop over medium-low heat. Use a thermometer to monitor the temperature. Heat the milk until it reaches approximately 150 degrees Fahrenheit. This temperature is ideal for creating a creamy texture without boiling the milk.",
      "Froth the milk: Once the milk is heated, use your preferred method to froth it. You can use a milk frother, a French press, or even a whisk. The goal is to create \"dry foam,\" which is light and fluffy. Froth the milk until you achieve the desired consistency and texture.",
      "Add the foam to the espresso: With a spoon, carefully scoop only the top layer of the foam (dry foam) and gently place it on the top of the espresso. The foam should float on the surface of the espresso, creating a delightful layer of creamy goodness.",
      "Serve and enjoy: Your espresso with dry foam is now ready to be enjoyed. Take a moment to appreciate the aroma and savor the rich flavors of the espresso. The dry foam adds a delightful texture and enhances the overall experience of the drink."
    ],
    "colors": [
      {
        "offset": "0%",
        "stopColor": "transparent"
      },
      {
        "offset": "15%",
        "stopColor": "transparent"
      },
      {
        "offset": "15%",
        "stopColor": "#fdf5e6"
      },
      {
        "offset": "76%",
        "stopColor": "#fdf5e6"
      },
      {
        "offset": "76%",
        "stopColor": "#86563a"
      },
      {
        "offset": "100%",
        "stopColor": "#86563a"
      }
    ]
  },
  {
    "name": "Doppio",
    "liked": false,
    "ingredients": [
      {
        "name": "coffee beans",
        "amount": "14 g"
      },
      {
        "name": "water",
        "amount": "60 ml"
      }
    ],
    "recipe": [
      "Purge/rinse the group head: Start by purging the espresso machine to remove any old coffee grinds. Run a small amount of water through the group head to flush out any residue from previous shots. Use a cloth to wipe away any dried coffee from the group head.",
      "Grind and tamp: Grind 18g of coffee beans to a fine consistency using a coffee grinder. Fill a double shot group head basket with the ground coffee. Give it a gentle shake to distribute the coffee evenly, then use a tamper to firmly press down and compact the coffee in the basket. Ensure a level tamp with no unevenness.",
      "Extract the espresso: Turn on your coffee maker's pump to initiate the extraction process. The water should flow through the coffee grounds at a pressure of 15 bars. Aim to extract 60ml (2 ounces) of espresso within a timeframe of 25-30 seconds. Adjust the grind size or coffee dose if needed to achieve the desired extraction time and volume.",
      "Done: Congratulations! Your espresso shot is ready. Take a moment to appreciate the rich aroma and beautiful crema on top of your espresso. Savor the flavors and enjoy the energizing caffeine buzz."
    ],
    "colors": [
      {
        "offset": "0%",
        "stopColor": "transparent"
      },
      {
        "offset": "49%",
        "stopColor": "transparent"
      },
      {
        "offset": "49%",
        "stopColor": "#cc8e69"
      },
      {
        "offset": "62%",
        "stopColor": "#cc8e69"
      },
      {
        "offset": "62%",
        "stopColor": "#86563a"
      },
      {
        "offset": "100%",
        "stopColor": "#86563a"
      }
    ]
  },
  {
    "name": "Irish Coffee",
    "liked": false,
    "ingredients": [
      {
        "name": "coffee beans",
        "amount": "14 g"
      },
      {
        "name": "water",
        "amount": "150 ml"
      },
      {
        "name": "sugar",
        "amount": "10 g"
      },
      {
        "name": "Irish whiskey",
        "amount": "50 ml"
      }
    ],
    "recipe": [
      "Make the coffee: Brew your favorite coffee using your preferred method. Whether you use a drip coffee maker, French press, or any other brewing technique, make a strong and flavorful cup of coffee to serve as the base for your Irish coffee.",
      "Prepare homemade whipped cream: In a chilled mixing bowl, pour in heavy cream and whip it using a whisk or an electric mixer. Continue whipping until the cream thickens and reaches a soft peak consistency. Be careful not to overwhip, as it should still be creamy and not stiff.",
      "Add the coffee and sweeten: Pour the freshly brewed coffee into a glass or Irish coffee mug, leaving about an inch of space at the top for the cream. Stir in the desired amount of sugar to your taste preferences, ensuring it dissolves completely in the hot coffee. If desired, add a shot of Irish whiskey to enhance the flavor.",
      "Float the whipped cream: Take a spoon and gently place it over the coffee, facing down. Slowly pour the whipped cream onto the back of the spoon, allowing it to float on top of the coffee without immediately sinking. This technique helps create a distinct layer of creamy goodness.",
      "Serve and enjoy: Your Irish coffee is now ready to be savored! Present it with a spoon and invite your guests to gently stir the cream into the coffee for a delightful blend of flavors. Sip and enjoy the warm, comforting combination of coffee, sweetened cream, and a touch of whiskey."
    ],
    "colors": [
      {
        "offset": "0%",
        "stopColor": "transparent"
      },
      {
        "offset": "37%",
        "stopColor": "transparent"
      },
      {
        "offset": "37%",
        "stopColor": "#fffaf0"
      },
      {
        "offset": "48%",
        "stopColor": "#fffaf0"
      },
      {
        "offset": "48%",
        "stopColor": "#bb5c44"
      },
      {
        "offset": "62%",
        "stopColor": "#bb5c44"
      },
      {
        "offset": "62%",
        "stopColor": "#86563a"
      },
      {
        "offset": "100%",
        "stopColor": "#86563a"
      }
    ]
  },
  {
    "name": "Lungo",
    "liked": false,
    "ingredients": [
      {
        "name": "coffee beans",
        "amount": "9 g"
      },
      {
        "name": "water",
        "amount": "100 ml"
      }
    ],
    "recipe": [
      "Grind the coffee: Select your favorite roast and brand of coffee beans, then grind them to a very fine consistency. The grind size may vary depending on your espresso machine, so experiment with different settings to achieve the desired result. It's recommended to do a few test runs to find the optimal grind size.",
      "Pack and tamp the coffee grounds: Take the espresso basket, also known as the portafilter, and add the ground coffee until it slightly overflows from the top. Use a tamper to evenly press the coffee grounds into the portafilter, applying firm pressure to achieve a compacted puck. To protect your counter or filter, place the portafilter on a folded towel or use the ledge of a knock box as a surface for tamping.",
      "Pull the shot: Insert the portafilter into the espresso machine and activate the Manual mode. Start the extraction process by pressing the button to initiate the shot. Pay close attention to the timing, aiming for a 15 to 20-second extraction time. This shorter duration will result in a double ristretto shot, yielding approximately 1 ½ ounces of concentrated coffee with a rich, caramel-colored crema. This differs from the longer extraction time of 25 to 30 seconds typically used for a standard espresso doubleshot.",
      "Consider adjustments: Achieving the perfect ristretto shot may require some adjustments. If the shot appears watery or lacks intensity, try using slightly more coffee grounds or adjusting to a finer grind size. Continue to fine-tune the process until you achieve the desired flavor and strength in your ristretto shot."
    ],
    "colors": [
      {
        "offset": "0%",
        "stopColor": "transparent"
      },
      {
        "offset": "62%",
        "stopColor": "transparent"
      },
      {
        "offset": "62%",
        "stopColor": "#86563a"
      },
      {
        "offset": "100%",
        "stopColor": "#86563a"
      }
    ]
  }
]